{
  "plugins": {
    "arc": {
      "src": "https://codeberg.org/knight9114/arc.nvim"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "fidget": {
      "src": "https://github.com/j-hui/fidget.nvim"
    },
    "gitsigns": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "grug-far": {
      "src": "https://github.com/MagicDuck/grug-far.nvim"
    },
    "indent-blankline": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim"
    },
    "neo-tree.nvim": {
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim",
      "version": "3.0.0 - 4.0.0"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "statuscol": {
      "src": "https://github.com/luukvbaal/statuscol.nvim"
    },
    "telescope": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "telescope-fzf-native": {
      "src": "https://github.com/nvim-telescope/telescope-fzf-native.nvim"
    },
    "telescope-fzf-native.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-fzf-native.nvim"
    },
    "telescope-live-grep-args": {
      "src": "https://github.com/nvim-telescope/telescope-live-grep-args.nvim"
    },
    "telescope-live-grep-args.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-live-grep-args.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "termite": {
      "src": "https://github.com/ruicsh/termite.nvim"
    },
    "treewalker": {
      "src": "https://github.com/aaronik/treewalker.nvim"
    },
    "trouble": {
      "src": "https://github.com/folke/trouble.nvim"
    },
    "vim-move": {
      "src": "https://github.com/matze/vim-move"
    },
    "vim-surround": {
      "src": "https://github.com/tpope/vim-surround"
    },
    "which-key": {
      "src": "https://github.com/folke/which-key.nvim"
    },
    "zen-mode": {
      "src": "https://github.com/folke/zen-mode.nvim"
    }
  }
}
